TOKEN = "8048336764:AAG3E5F7j9-sTrZI9dEYxW4lOkVXJ3qL1gs"

# Настройки канала
ID_CHANNEL = "-1002263271408"  # ID канала (можно использовать @username или числовой ID с минусом для приватных каналов)
LINK_CHANNEL = "https://t.me/+mTkbu2O_Sh82ZTIy"  # Ссылка на канал для кнопки подписки

ADMIN_IDS = [872038976]    # ID администраторов

# База пользователей для докса
DOX_TABLE = {
    "Мефи": 20,
    "Локси": 15,
    "Кибер": 30,
    "Тень": 10,
    "Чапаев": 15,
    "Мистери": 10,
    "Квантум": 1,
    "Авайка": 3,
    "СнялЦепи": 20,
    "Шейм": 10,
    "Тротилов": 10,
    "Троффи": 15,
    "Икея": 5,
    "Орехов": 10,
    "Истерика": 5,
    "Лордик": 20,
    "Вавилон": 25,
    "Акса": 5,
    "Лосарус": 5,
    "Плакса": 15,
    "Фантом": 25
}

# Пасхалки
EASTER_EGGS = [
    {
        "message": "🎉 Ты смог задоксить эспаду! +200 очков!",
        "points": 200
    },
    {
        "message": "💥 Ты не смог задоксить, и вас задоксили! -100 очков.",
        "points": -20
    },
    {
        "message": "👑 Вы нашли секретные данные Дурова! +100 очков!",
        "points": 100
    }
]
